In [1]:
import pandas as pd
import matplotlib as plt
import numpy as np

In [2]:
#Unzip wgnd_langctry.csv.zip and load read the csv
df = pd.read_csv('wgnd_langctry.csv', usecols=['name', 'gender', 'code'])
# df = pd.read_csv('wgnd_langctry.csv')

In [260]:
df.head()

       name gender code
0  A HANNAN      M   CF
1  A HANNAN      M   BJ
2  A HANNAN      M   TD
3  A HANNAN      M   TG
4  A HANNAN      M   BE

In [215]:
df.shape

(6277039, 3)

In [216]:
# df = df.drop_duplicates(subset= ['name','gender'] , keep='first')

In [217]:
df = df.dropna()

In [218]:
df.shape

(6277003, 3)

In [219]:
df['first_name'] = df['name'].str.split(' ').str[0]

In [220]:
df.head()

       name gender code first_name
0  A HANNAN      M   CF          A
1  A HANNAN      M   BJ          A
2  A HANNAN      M   TD          A
3  A HANNAN      M   TG          A
4  A HANNAN      M   BE          A

In [221]:
def split_join_lastname(name):
    name_list = name.split(' ')
    return ' '.join(name_list[1:])

In [222]:
df['last_name'] = df['name'].apply(split_join_lastname)

In [223]:
df.reset_index(inplace=True)

In [224]:
df.head()

   index      name gender code first_name last_name
0      0  A HANNAN      M   CF          A    HANNAN
1      1  A HANNAN      M   BJ          A    HANNAN
2      2  A HANNAN      M   TD          A    HANNAN
3      3  A HANNAN      M   TG          A    HANNAN
4      4  A HANNAN      M   BE          A    HANNAN

In [225]:
df.drop(columns='index', inplace=True)

In [226]:
df.head()

       name gender code first_name last_name
0  A HANNAN      M   CF          A    HANNAN
1  A HANNAN      M   BJ          A    HANNAN
2  A HANNAN      M   TD          A    HANNAN
3  A HANNAN      M   TG          A    HANNAN
4  A HANNAN      M   BE          A    HANNAN

In [227]:
# df = df[['first_name', 'last_name', 'name', 'gender']]
df.rename(columns={'name': 'raw_name'}, inplace=True)

In [228]:
pd.set_option('max_rows', None)

In [229]:
df = df.iloc[:6276056,:]

In [230]:
df = df[['raw_name','first_name', 'last_name', 'gender']]

In [231]:
# df.to_csv('temp.csv', index = False)
df.head()
# df.shape

   raw_name first_name last_name gender
0  A HANNAN          A    HANNAN      M
1  A HANNAN          A    HANNAN      M
2  A HANNAN          A    HANNAN      M
3  A HANNAN          A    HANNAN      M
4  A HANNAN          A    HANNAN      M

In [74]:
# sample1 = df.head(1000)

In [232]:
df = df.groupby(["raw_name","first_name", "last_name", 'gender']).size().reset_index(name="Count")
df.head()

   raw_name first_name last_name gender  Count
0  A HANNAN          A    HANNAN      M     50
1     A JAY          A       JAY      M     50
2   A K I L          A     K I L      M     50
3     A LAH          A       LAH      F     50
4     A RIN          A       RIN      F     50

In [239]:
df = df.set_index(["raw_name","first_name", "last_name", 'gender'], drop=True).unstack('gender')

KeyError: "None of ['raw_name', 'first_name', 'last_name', 'gender'] are in the columns"

In [241]:
df.head()

                              Count
gender                            F     M
raw_name first_name last_name
A HANNAN A          HANNAN      NaN  50.0
A JAY    A          JAY         NaN  50.0
A K I L  A          K I L       NaN  50.0
A LAH    A          LAH        50.0   NaN
A RIN    A          RIN        50.0   NaN

In [103]:
# test_file.head(3)
# # test_file_columns = ['raw_name', 'first_name', 'last_name', 'f_count', 'm_count']
# # test_file.columns = test_file_columns
# # test_file.head(3)
# test_file.shape
# test_file.dtypes

       gender
Count  F         float64
       M         float64
dtype: object

In [242]:
# df.to_csv('cleaned_Gender_count')

In [243]:
test_file_columns = ['raw_name', 'first_name', 'last_name', 'f_count', 'm_count']
new_df = pd.read_csv('cleaned_Gender_count', names=  test_file_columns)
new_df = new_df.drop(0).drop(1).drop(2)

/Users/anildhage/opt/anaconda3/lib/python3.8/site-packages/IPython/core/interactiveshell.py:3071: DtypeWarning: Columns (3,4) have mixed types.Specify dtype option on import or set low_memory=False.
  has_raised = await self.run_ast_nodes(code_ast.body, cell_name,

In [244]:
new_df.head()

   raw_name first_name last_name f_count m_count
3  A HANNAN          A    HANNAN     NaN    50.0
4     A JAY          A       JAY     NaN    50.0
5   A K I L          A     K I L     NaN    50.0
6     A LAH          A       LAH    50.0     NaN
7     A RIN          A       RIN    50.0     NaN

In [245]:
new_df.reset_index(inplace=True)

In [246]:
new_df.drop(columns='index', inplace=True)

In [247]:
new_df.f_count.fillna('0', inplace=True)
new_df.m_count.fillna('0', inplace=True)

In [248]:
# new_df['f_count'] = new_df["f_count"].astype('int')
new_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 174352 entries, 0 to 174351
Data columns (total 5 columns):
 #   Column      Non-Null Count   Dtype
---  ------      --------------   -----
 0   raw_name    174352 non-null  object
 1   first_name  174347 non-null  object
 2   last_name   14616 non-null   object
 3   f_count     174352 non-null  object
 4   m_count     174352 non-null  object
dtypes: object(5)
memory usage: 6.7+ MB

In [250]:
new_df["f_count"] = new_df["f_count"].astype(int)
new_df["m_count"] = new_df["m_count"].astype(int)

In [251]:
new_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 174352 entries, 0 to 174351
Data columns (total 5 columns):
 #   Column      Non-Null Count   Dtype
---  ------      --------------   -----
 0   raw_name    174352 non-null  object
 1   first_name  174347 non-null  object
 2   last_name   14616 non-null   object
 3   f_count     174352 non-null  int64
 4   m_count     174352 non-null  int64
dtypes: int64(2), object(3)
memory usage: 6.7+ MB

In [252]:
new_df.head()

   raw_name first_name last_name  f_count  m_count
0  A HANNAN          A    HANNAN        0       50
1     A JAY          A       JAY        0       50
2   A K I L          A     K I L        0       50
3     A LAH          A       LAH       50        0
4     A RIN          A       RIN       50        0

In [255]:
new_df.to_csv('cleaned_Gender_count.csv', index=False)

In [50]:
df.loc[df['first_name'] == 'JAY']

              raw_name first_name    last_name gender
71509              JAY        JAY                   M
71510         JAY ALEX        JAY         ALEX      M
71511          JAY ANN        JAY          ANN      F
71512           JAY AR        JAY           AR      M
71513  JAY CHRISTOPHER        JAY  CHRISTOPHER      M
71514            JAY D        JAY            D      M
71515           JAY DE        JAY           DE      M
71516         JAY DEAN        JAY         DEAN      F
71517          JAY DEE        JAY          DEE      M
71518          JAY DIE        JAY          DIE      M
71519      JAY DOMINIC        JAY      DOMINIC      M
71520            JAY J        JAY            J      M
71521          JAY JAY        JAY          JAY      M
71522       JAY JUNIOR        JAY       JUNIOR      M
71523          JAY LEE        JAY          LEE      F
71524        JAY LEENA        JAY        LEENA      F
71525        JAY LEIGH        JAY        LEIGH      F
71526          JAY LIN        JAY          LIN      F
71527        JAY LOGAN        JAY        LOGAN      M
71528          JAY LYN        JAY          LYN      F
71529         JAY LYNN        JAY         LYNN      F
71530      JAY MICHAEL        JAY      MICHAEL      M
71531          JAY MOR        JAY          MOR      M
71532         JAY MYER        JAY         MYER      M
71533       JAY OLIVER        JAY       OLIVER      M
71534            JAY P        JAY            P      M
71535        JAY PETER        JAY        PETER      M
71536            JAY R        JAY            R      M
71537        JAY SCOTT        JAY        SCOTT      M
71538            JAY T        JAY            T      M
71539            JAY Z        JAY            Z      M

In [14]:
def split_join_lastname(name):
    name_list = name.split(' ')
    return ' '.join(name_list[1:])

In [16]:
df = pd.read_csv('names_with_space_char.csv', usecols=['name', 'gender'])
df['first_name'] = df['name'].str.split(' ').str[0]
# df['last_name'] = df['name'].str.split(' ').str[1] + ' ' + str[2]
df['last_name'] = df['name'].apply(split_join_lastname)

In [17]:
df.head(10)

            name gender first_name last_name
0       A HANNAN      M          A    HANNAN
1          A JAY      M          A       JAY
2        A K I L      M          A     K I L
3          A LAH      F          A       LAH
4          A RIN      F          A       RIN
5          A S M      M          A       S M
6       AA ISHAH      F         AA     ISHAH
7         AAD TY      M        AAD        TY
8   AAISHA MALEK      F     AAISHA     MALEK
9  AAISHAH AMINA      F    AAISHAH     AMINA

In [18]:
df.to_csv('temp.csv')

In [19]:
df.shape

(14624, 4)

In [12]:
li = ['venkati', 'maroti', 'dhage']
' '.join(li[1:])

'maroti dhage'